{
  "/::hinglish": "Core idea:\nInterest rates decide kitna mehenga loan ya EMI hoga. Jab rates badhte hain, borrowing mehenga ho jata hai, isliye consumers aur businesses kam kharch aur investment karte hain. Central banks rates badhate ya ghatate hain taaki inflation control ho aur economy zyada steady rahe. Rate hike growth ko slow karta hai, rate cut growth ko boost kar sakta hai lekin inflation badh sakti hai.\n\nAnalogy (if helpful):\nSocho interest rate ek tap jaisa hai jo paise ka flow control karta hai. Tap tight karoge (rate badhao), paise ka flow kam hoga aur spending rukegi; tap khologe (rate ghatayo), paise zyada flow karenge aur log zyada kharche karenge.",
  "/::telgish": "Core idea: Interest rates ante banks and lenders charge chesey cost for a loan. Rate perigi ante loans costly avuthayi, so people spending thaggistaru, companies investment cut chestaru, economy slow avvachu. Rate thaggite opposite, borrowing cheap avutundi, spending and growth peragachu. Central bank interest rates penchadam leda thaggadam valla, inflation ni control cheyadam and economy ni steady ga undadaniki try chestaru.\n\nAnalogy (simple): Ikkada central bank ni water tap laga anukondi. Tap ekkuvaga open cheste water fast ga flow avutundi, tank full ayye speed peruguthundi (economy hot, inflation peragachu). Tap thaggite flow slow avutundi, tank slow ga fill avutundi (economy cool avuthundi, inflation thagguthundi).",
  "undefined::hinglish": "Core idea:\nInterest rates decide kitna mehnga hai loan lena. Jab interest rates badhte hain, loans aur EMIs zyada ho jaate hain, isliye log aur businesses spending aur investment kam kar dete hain. Central banks interest rates badal ke inflation ko control karte hain aur economy ko stable rakhte hain. Isliye rate changes se jobs, prices aur market activity pe seedha asar padta hai.\n\nAnalogy (optional, useful):\nSocho interest rate ek paani ka tap hai. Tap khula hai toh paani zyada flow karega, log kharch karenge. Tap thoda band kar do, paani kam aayega, log bachaayenge. Central bank wahi tap control karta hai, inflation aur growth balance karne ke liye.",
  "undefined::telgish": "Core idea: interest rates economy lo chala important. Rates perugutunte loans costly avuthayi, so people and businesses thakkuva borrow chestaru. Adhi spending and investment ni slow chestundi, economy growth meda effect padutundi. Central bank interest rates use chestundi to control inflation and keep growth steady. Inflation ekkuva unte rates penchutaru, demand taggadam valla prices control avutayi. Economy slow unna situation lo rates cut chestaru, borrowing and spending boost avutayi.\n\nAnalogy (clear ga ardham avutundi ante): interest rate ni oka water tap laga anukondi. Tap full open chesina, water (money) ekkuva flow avutundi, shops and builders water tengi projects chestaru, but overflow avvachu (inflation). Tap tight chesina, water thakkuva, people careful ga use chestaru, gharam calm avutundi, overflow stop avutundi. Central bank antaamidi, tap adjust chesi water level control chestundi.",
  "/index.html::hinglish": "Core idea:\nInterest rates economy ka ek powerful tool hain. Jab interest rates badhte hain, loans aur EMIs mehange ho jaate hain, isliye consumers aur businesses kam kharch aur kam investment karte hain. Central banks interest rates ko badha ya ghata ke inflation ko control karte hain aur economic growth ko stable rakhne ki koshish karte hain. Ye decisions directly tumhare loan, EMI, aur prices ko affect karte hain.\n\nAnalogy (simple):\nSocho central bank economy ka thermostat hai. Jab ghar bahut garam ho (inflation high), thermostat thanda karta hai — matlab interest rates badhate hain, paise ka flow kam hota, ghar thanda hota. Jab ghar thanda ho (economy slow), thermostat heat karta hai — interest rates ghatate hain, log zyada loan lete aur kharch badhta.",
  "/index.html::telgish": "Interest rates economy lo chala important.  \nInterest rates peragite, loan theesukovadam costly avthundi, EMI ekkuva avutayi.  \nDaani valla people and businesses spending, investment cut chestaru, economy slow avvachu.  \nCentral banks interest rates ni tool laga use chestaru, inflation control cheyadaniki and growth ni stable ga maintain cheyadaniki.  \nInflation ekkuva aina, central bank rates peristhadi to demand cool cheyadam, prices slow avutayi.  \nKani rates chala ekkuva unte, growth slow avvachu, businesses and consumers hurt avutaru.  \n\nAnalogy:  \nInterest rates ni car speed regulator laga chudandi.  \nInflation fast unte, central bank brake pedthundi by raising interest rates.  \nBrake vadinappudu car slow avtundi, same way spending and investment slow avutayi."
}